app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"  WHERE (photo_id = 'SAUTCiMjguE.jpg')
---
  def index
    @photo_url = params[:photo_url] if params[:photo_url].present?
    @photo_id = User.getPhotoId( @photo_url )
    @comments = Comment.all.where( "photo_id = ?", @photo_id )

INSERT INTO "comments" ("body", "commenter", "created_at", "photo_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sdaerwerwqe"], ["commenter", "ewewfadf"], ["created_at", "2014-09-07 09:36:44.190631"], ["photo_id", 0], ["updated_at", "2014-09-07 09:36:44.190631"]]
---
  def create
    @comment = Comment.new(comment_params)
    respond_to do |format|
      if @comment.save