app/controllers/omniauth_callbacks_controller.rb

  def google_oauth2
      @user = User.find_for_google_oauth2(env["omniauth.auth"], current_user)
---
SELECT  "users".* FROM "users"  WHERE (email = 'stranger9983@gmail.com')  ORDER BY "users"."id" ASC LIMIT 1