app/controllers/user_controller.rb

	def photo_comments
		@user = User.getCurrentUser
		@photo_id = User.getPhotoId( params[:photo_url] ) if params[:photo_url].present?
---
SELECT commenter, body FROM "users"  WHERE (photo_id = 'SAUTCiMjguE.jpg')